1. 모듈로딩

In [1]:
import pandas as pd


2. 데이터 로딩

In [2]:
file='../DATA/employees.csv'

In [3]:
empDF=pd.read_csv(file,parse_dates=['Start Date'])

C:\Users\kdp\AppData\Local\Temp\ipykernel_4388\1923677844.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  empDF=pd.read_csv(file,parse_dates=['Start Date'])

In [4]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       NaN   True     Marketing
1        Thomas    Male 1996-03-31   61933.0   True           NaN
2         Maria  Female        NaT  130590.0  False       Finance
3         Jerry     NaN 2005-03-04  138705.0   True       Finance
4         Larry    Male 1998-01-24  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male 1984-01-31   42392.0  False       Finance
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
999      Albert    Male 2012-05-15  129949.0   True         Sales
1000        NaN     NaN        NaT       NaN    NaN           NaN

[1001 rows x 6 columns]

In [5]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

5.1.1 astype메서드 사용하기

In [6]:
empDF["Mgmt"]=empDF["Mgmt"].astype(bool)

In [7]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), datetime64[ns](1), float64(1), object(3)
memory usage: 40.2+ KB

In [8]:
empDF.tail()

     First Name Gender Start Date    Salary   Mgmt          Team
996     Phillip   Male 1984-01-31   42392.0  False       Finance
997     Russell   Male 2013-05-20   96914.0  False       Product
998       Larry   Male 2013-04-20   60500.0  False  Business Dev
999      Albert   Male 2012-05-15  129949.0   True         Sales
1000        NaN    NaN        NaT       NaN   True           NaN

In [9]:
# empDF["Salary"].astype(int)   

#판다스는 NaN값을 정수로 변환 시킬수가 없다.... fillna()로 쓰자

In [10]:
empDF["Salary"].fillna(0).tail()

996      42392.0
997      96914.0
998      60500.0
999     129949.0
1000         0.0
Name: Salary, dtype: float64

In [11]:
empDF["Salary"].isna().sum()

2

In [12]:
empDF["Salary"].fillna(0).astype(int).tail()

996      42392
997      96914
998      60500
999     129949
1000         0
Name: Salary, dtype: int32

In [13]:
# int로 바뀌었다... astype(int)단독으로는 널 값을 변경 시킬수 없으므로, fillna 함수를 써서 먼저, null 값을 0으로 변환시킨뒤 astype 사용

In [14]:
# 범주형: 소수의 고유값으로 구성된 열에 적용하기 좋다.

In [15]:
empDF.nunique()

First Name    200
Gender          2
Start Date    971
Salary        994
Mgmt            2
Team           10
dtype: int64

In [16]:
empDF["Gender"]=empDF["Gender"].astype("category")

In [17]:
empDF["Team"]=empDF["Team"].astype("category")

In [18]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](1), float64(1), object(1)
memory usage: 27.0+ KB

5.2 단일 조건 필터링

In [19]:
empDF['First Name']=="Maria"

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: First Name, Length: 1001, dtype: bool

In [20]:
marias=empDF["First Name"]=="Maria"
empDF[marias]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaT  130590.0  False       Finance
198      Maria  Female 1990-12-27   36067.0   True       Product
815      Maria     NaN 1986-01-18  106562.0  False            HR
844      Maria     NaN 1985-06-19  148857.0  False         Legal
936      Maria  Female 2003-03-14   96250.0  False  Business Dev
984      Maria  Female 2011-10-15   43455.0  False   Engineering

In [21]:
empDF[empDF["First Name"]=="Maria"] # 위와 같다....

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaT  130590.0  False       Finance
198      Maria  Female 1990-12-27   36067.0   True       Product
815      Maria     NaN 1986-01-18  106562.0  False            HR
844      Maria     NaN 1985-06-19  148857.0  False         Legal
936      Maria  Female 2003-03-14   96250.0  False  Business Dev
984      Maria  Female 2011-10-15   43455.0  False   Engineering

In [22]:
"Finance"!="Engineering"

True

In [23]:
finances=empDF["Team"]!="Finance"
empDF[finances]

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       NaN   True     Marketing
1        Thomas    Male 1996-03-31   61933.0   True           NaN
4         Larry    Male 1998-01-24  101004.0   True            IT
5        Dennis    Male 1987-04-18  115163.0  False         Legal
6          Ruby  Female 1987-08-17   65476.0   True       Product
...         ...     ...        ...       ...    ...           ...
995       Henry     NaN 2014-11-23  132483.0  False  Distribution
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
999      Albert    Male 2012-05-15  129949.0   True         Sales
1000        NaN     NaN        NaT       NaN   True           NaN

[899 rows x 6 columns]

In [24]:
# 연봉이 100000보다 큰지 나타내는 불리언 시리즈?

In [25]:
s100000= (empDF["Salary"] > 100000)

In [26]:
empDF[s100000].head()

  First Name  Gender Start Date    Salary   Mgmt          Team
2      Maria  Female        NaT  130590.0  False       Finance
3      Jerry     NaN 2005-03-04  138705.0   True       Finance
4      Larry    Male 1998-01-24  101004.0   True            IT
5     Dennis    Male 1987-04-18  115163.0  False         Legal
9    Frances  Female 2002-08-08  139852.0   True  Business Dev

5.3 다중 조건으로 필터링

5.3.1 AND 조건

In [27]:
femask=empDF["Gender"]=="Female"
femask

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Gender, Length: 1001, dtype: bool

In [28]:
bumask=empDF["Team"]=="Business Dev"
bumask

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998      True
999     False
1000    False
Name: Team, Length: 1001, dtype: bool

In [29]:
empDF[(empDF["Gender"]=="Female")&(empDF["Team"]=="Business Dev")].head()

   First Name  Gender Start Date    Salary   Mgmt          Team
9     Frances  Female 2002-08-08  139852.0   True  Business Dev
33       Jean  Female 1993-12-18  119082.0  False  Business Dev
36     Rachel  Female 2009-02-16  142032.0  False  Business Dev
38  Stephanie  Female 1986-09-13   36844.0   True  Business Dev
61     Denise  Female 2001-11-06  106862.0  False  Business Dev

5.3.2 or 조건

In [30]:
#연봉 40000 미만이거나 입사일이 2015년 1월 1일 이후

In [31]:
sa40000=empDF["Salary"]<40000
daymask=empDF["Start Date"]>"2015-01-01"

In [32]:
empDF[sa40000|daymask].head()

   First Name  Gender Start Date   Salary   Mgmt          Team
7         NaN  Female 2015-07-20  45906.0   True       Finance
15    Lillian  Female 2016-06-05  59414.0  False       Product
25        NaN    Male 2012-10-08  37076.0   True            IT
26      Craig    Male 2000-02-27  37598.0   True     Marketing
38  Stephanie  Female 1986-09-13  36844.0   True  Business Dev

In [33]:
# 100000이상을 버는 직원=>~로 표현

In [34]:
s100000=empDF["Salary"]>=100000

In [35]:
nos100000=empDF[~s100000].head()
nos100000

  First Name  Gender Start Date   Salary  Mgmt         Team
0    Douglas    Male 1993-08-06      NaN  True    Marketing
1     Thomas    Male 1996-03-31  61933.0  True          NaN
6       Ruby  Female 1987-08-17  65476.0  True      Product
7        NaN  Female 2015-07-20  45906.0  True      Finance
8     Angela  Female 2005-11-22  95570.0  True  Engineering

In [36]:
empDF["Team"]=="Marketing"
empDF["Team"].eq("Marketing")

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Team, Length: 1001, dtype: bool

In [37]:
empDF["Team"]!="Marketing"
empDF["Team"].ne("Marketing")  #neglect

0       False
1        True
2        True
3        True
4        True
        ...
996      True
997      True
998      True
999      True
1000     True
Name: Team, Length: 1001, dtype: bool

In [38]:
empDF["Salary"]<100000
empDF["Salary"].lt(100000)

0       False
1        True
2       False
3       False
4       False
        ...
996      True
997      True
998      True
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [39]:
empDF["Salary"]<=100000
empDF["Salary"].le(100000)

0       False
1        True
2       False
3       False
4       False
        ...
996      True
997      True
998      True
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [40]:
empDF["Salary"]>100000
empDF["Salary"].gt(100000)

0       False
1       False
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

In [41]:
empDF["Salary"]>=100000
empDF["Salary"].ge(100000)

0       False
1       False
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

5.4 조건별 필터링

5.4.1 isin 메서드

Sales,Legal,Marketing 팀에 속하는 직원을 추출

In [42]:
sales=empDF["Team"]=="Sales"
legal=empDF["Team"]=="Legal"
mktg=empDF["Team"]=="Marketing"
empDF[sales|legal|mktg].head()

   First Name  Gender Start Date    Salary   Mgmt       Team
0     Douglas    Male 1993-08-06       NaN   True  Marketing
5      Dennis    Male 1987-04-18  115163.0  False      Legal
11      Julie  Female 1997-10-26  102508.0   True      Legal
13       Gary    Male 2008-01-27  109831.0  False      Sales
20       Lois     NaN 1995-04-22   64714.0   True      Legal

방법2. 멤버 연산자 isin사용

In [43]:
allstar=["Sales","Legal","Marketing"]
ALLSTAR=empDF["Team"].isin(allstar)

In [44]:
empDF[ALLSTAR]

    First Name  Gender Start Date    Salary   Mgmt       Team
0      Douglas    Male 1993-08-06       NaN   True  Marketing
5       Dennis    Male 1987-04-18  115163.0  False      Legal
11       Julie  Female 1997-10-26  102508.0   True      Legal
13        Gary    Male 2008-01-27  109831.0  False      Sales
20        Lois     NaN 1995-04-22   64714.0   True      Legal
..         ...     ...        ...       ...    ...        ...
986      Donna  Female 1982-11-26   82871.0  False  Marketing
989     Justin     NaN 1991-02-10   38344.0  False      Legal
991       Rose  Female 2002-08-25  134505.0   True  Marketing
994     George    Male 2013-06-21   98874.0   True  Marketing
999     Albert    Male 2012-05-15  129949.0   True      Sales

[280 rows x 6 columns]

5.4.2 between 메서드

In [45]:
high80=empDF["Salary"]>=80000
low90=empDF["Salary"]<90000
hilo8090=empDF["Salary"].between(80000,90000)

In [46]:
empDF[hilo8090]

    First Name  Gender Start Date   Salary   Mgmt         Team
19       Donna  Female 2010-07-22  81014.0  False      Product
31       Joyce     NaN 2005-02-20  88657.0  False      Product
35     Theresa  Female 2006-10-10  85182.0  False        Sales
45       Roger    Male 1980-04-17  88010.0   True        Sales
54        Sara  Female 2007-08-15  83677.0  False  Engineering
..         ...     ...        ...      ...    ...          ...
930      Nancy  Female 2001-09-10  85213.0   True    Marketing
956    Beverly  Female 1986-10-17  80838.0  False  Engineering
963        Ann  Female 1994-09-23  89443.0   True        Sales
985    Stephen     NaN 1983-07-10  85668.0  False        Legal
986      Donna  Female 1982-11-26  82871.0  False    Marketing

[94 rows x 6 columns]

In [47]:
eifolks=empDF["Start Date"].between(left="1980-01-01",right="1990-01-01")

In [48]:
empDF[eifolks].head().sort_values("Start Date",ascending=False) #오름차순

   First Name  Gender Start Date    Salary   Mgmt     Team
6        Ruby  Female 1987-08-17   65476.0   True  Product
5      Dennis    Male 1987-04-18  115163.0  False    Legal
17      Shawn    Male 1986-12-07  111737.0  False  Product
12    Brandon    Male 1980-12-01  112807.0   True       HR
10     Louise  Female 1980-08-12   63241.0   True      NaN

5.4.3 inull,notnull

In [49]:
empDF["Team"].isnull()

0       False
1        True
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000     True
Name: Team, Length: 1001, dtype: bool

In [50]:
empDF["Team"].isnull().sum()  #44개 존재

44

In [51]:
empDF["Team"].notnull().sum() # 2개 합치면 1001개 맞음

957

In [52]:
no_team=empDF["Team"].isnull()
no_team.head()

0    False
1     True
2    False
3    False
4    False
Name: Team, dtype: bool

In [53]:
empDF[no_team].head()

   First Name  Gender Start Date    Salary   Mgmt Team
1      Thomas    Male 1996-03-31   61933.0   True  NaN
10     Louise  Female 1980-08-12   63241.0   True  NaN
23        NaN    Male 2012-06-14  125792.0   True  NaN
32        NaN    Male 1998-08-21  122340.0   True  NaN
91      James     NaN 2005-01-26  128771.0  False  NaN

In [54]:
no_name=empDF["First Name"].notnull()
no_name

0        True
1        True
2        True
3        True
4        True
        ...
996      True
997      True
998      True
999      True
1000    False
Name: First Name, Length: 1001, dtype: bool

In [55]:
empDF[no_name]

    First Name  Gender Start Date    Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       NaN   True     Marketing
1       Thomas    Male 1996-03-31   61933.0   True           NaN
2        Maria  Female        NaT  130590.0  False       Finance
3        Jerry     NaN 2005-03-04  138705.0   True       Finance
4        Larry    Male 1998-01-24  101004.0   True            IT
..         ...     ...        ...       ...    ...           ...
995      Henry     NaN 2014-11-23  132483.0  False  Distribution
996    Phillip    Male 1984-01-31   42392.0  False       Finance
997    Russell    Male 2013-05-20   96914.0  False       Product
998      Larry    Male 2013-04-20   60500.0  False  Business Dev
999     Albert    Male 2012-05-15  129949.0   True         Sales

[933 rows x 6 columns]

5.4.4 null 값 다루기

In [56]:
empDF2=pd.read_csv("../DATA/employees.csv",parse_dates=["Start Date"])

C:\Users\kdp\AppData\Local\Temp\ipykernel_4388\458679111.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  empDF2=pd.read_csv("../DATA/employees.csv",parse_dates=["Start Date"])

In [57]:
# na값 제거하기 dropna

In [58]:
empDF2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [59]:
empDF2.dropna(how='all').tail() # 모든값이 누락된 행을 제거 => dropna(how="all")

    First Name Gender Start Date    Salary   Mgmt          Team
995      Henry    NaN 2014-11-23  132483.0  False  Distribution
996    Phillip   Male 1984-01-31   42392.0  False       Finance
997    Russell   Male 2013-05-20   96914.0  False       Product
998      Larry   Male 2013-04-20   60500.0  False  Business Dev
999     Albert   Male 2012-05-15  129949.0   True         Sales

In [60]:
empDF2.dropna(how='any').tail()  #하나 이상 있으면 제거=> dropna(how="any")

    First Name Gender Start Date    Salary   Mgmt          Team
994     George   Male 2013-06-21   98874.0   True     Marketing
996    Phillip   Male 1984-01-31   42392.0  False       Finance
997    Russell   Male 2013-05-20   96914.0  False       Product
998      Larry   Male 2013-04-20   60500.0  False  Business Dev
999     Albert   Male 2012-05-15  129949.0   True         Sales

In [61]:
empDF2.dropna(subset=["Gender"]).tail() # subset=["Gender"]  젠더 열을 따로 지정

    First Name Gender Start Date    Salary   Mgmt          Team
994     George   Male 2013-06-21   98874.0   True     Marketing
996    Phillip   Male 1984-01-31   42392.0  False       Finance
997    Russell   Male 2013-05-20   96914.0  False       Product
998      Larry   Male 2013-04-20   60500.0  False  Business Dev
999     Albert   Male 2012-05-15  129949.0   True         Sales

In [62]:
empDF2.dropna(subset=["Start Date","Salary"]).head()  # 두열 모두 값이 누락된 행을 제거.

  First Name  Gender Start Date    Salary   Mgmt     Team
1     Thomas    Male 1996-03-31   61933.0   True      NaN
3      Jerry     NaN 2005-03-04  138705.0   True  Finance
4      Larry    Male 1998-01-24  101004.0   True       IT
5     Dennis    Male 1987-04-18  115163.0  False    Legal
6       Ruby  Female 1987-08-17   65476.0   True  Product

In [63]:
# empDF2.dropna(how="any",thresh=4).head()   # 값이 최소 4개 이상 존재하는 행....

5.5 중복처리

duplicated 메서드

In [64]:
empDF['Team'].duplicated().head()  # 중복값이 있는지 보여줌

0    False
1    False
2    False
3     True
4    False
Name: Team, dtype: bool

In [65]:
empDF["Team"].duplicated(keep='first').head() #첫번쨰로 나타난 인덱스를 false로 표시

0    False
1    False
2    False
3     True
4    False
Name: Team, dtype: bool

In [66]:
empDF["Team"].duplicated(keep="last") #마지막으로 나타나는 값을 중복되지 않은 것으로 표시

0        True
1        True
2        True
3        True
4        True
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Team, Length: 1001, dtype: bool

In [67]:
(~empDF["Team"].duplicated()).head()

0     True
1     True
2     True
3    False
4     True
Name: Team, dtype: bool

5.5.2 drop_duplicates()

In [68]:
empDF.drop_duplicates()

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       NaN   True     Marketing
1        Thomas    Male 1996-03-31   61933.0   True           NaN
2         Maria  Female        NaT  130590.0  False       Finance
3         Jerry     NaN 2005-03-04  138705.0   True       Finance
4         Larry    Male 1998-01-24  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male 1984-01-31   42392.0  False       Finance
997     Russell    Male 2013-05-20   96914.0  False       Product
998       Larry    Male 2013-04-20   60500.0  False  Business Dev
999      Albert    Male 2012-05-15  129949.0   True         Sales
1000        NaN     NaN        NaT       NaN   True           NaN

[1001 rows x 6 columns]

In [69]:
empDF.drop_duplicates(subset=["Team"])  # 특정 열의 중복값을 제거 할떄.

   First Name  Gender Start Date    Salary   Mgmt          Team
0     Douglas    Male 1993-08-06       NaN   True     Marketing
1      Thomas    Male 1996-03-31   61933.0   True           NaN
2       Maria  Female        NaT  130590.0  False       Finance
4       Larry    Male 1998-01-24  101004.0   True            IT
5      Dennis    Male 1987-04-18  115163.0  False         Legal
6        Ruby  Female 1987-08-17   65476.0   True       Product
8      Angela  Female 2005-11-22   95570.0   True   Engineering
9     Frances  Female 2002-08-08  139852.0   True  Business Dev
12    Brandon    Male 1980-12-01  112807.0   True            HR
13       Gary    Male 2008-01-27  109831.0  False         Sales
40    Michael    Male 2008-10-10   99283.0   True  Distribution

In [70]:
# 이름이 더글러스이고 성별이 male인 모든 직원 추출

In [71]:
nmmark=empDF["First Name"]=="Douglas"
malemark=empDF["Gender"]=='Male'

In [72]:
empDF[nmmark & malemark]

    First Name Gender Start Date    Salary   Mgmt         Team
0      Douglas   Male 1993-08-06       NaN   True    Marketing
217    Douglas   Male 1999-09-03   83341.0   True           IT
322    Douglas   Male 2002-01-08   41428.0  False      Product
835    Douglas   Male 2007-08-04  132175.0  False  Engineering

In [73]:
# 이 행 중에 하나만 추출하려면?

In [74]:
empDF.drop_duplicates(subset=["Gender","Team"]).head() # 이름과 성별이 동일한 나머지 값 제거

  First Name  Gender Start Date    Salary   Mgmt       Team
0    Douglas    Male 1993-08-06       NaN   True  Marketing
1     Thomas    Male 1996-03-31   61933.0   True        NaN
2      Maria  Female        NaT  130590.0  False    Finance
3      Jerry     NaN 2005-03-04  138705.0   True    Finance
4      Larry    Male 1998-01-24  101004.0   True         IT

5.6 코딩 챌린지

In [75]:
datafile='../DATA/netflix.csv'

In [76]:
netDF=pd.read_csv(datafile,parse_dates=["date_added"])

C:\Users\kdp\AppData\Local\Temp\ipykernel_4388\1444261575.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  netDF=pd.read_csv(datafile,parse_dates=["date_added"])

In [77]:
netDF

                      title        director date_added     type
0               Alias Grace             NaN 2017-11-03  TV Show
1            A Patch of Fog  Michael Lennox 2017-04-15    Movie
2                  Lunatics             NaN 2019-04-19  TV Show
3                 Uriyadi 2     Vijay Kumar 2019-08-02    Movie
4         Shrek the Musical     Jason Moore 2013-12-29    Movie
...                     ...             ...        ...      ...
5832            The Pursuit     John Papola 2019-08-07    Movie
5833       Hurricane Bianca   Matt Kugelman 2017-01-01    Movie
5834           Amar's Hands  Khaled Youssef 2019-04-26    Movie
5835  Bill Nye: Science Guy  Jason Sussberg 2018-04-25    Movie
5836           Age of Glory             NaN        NaT  TV Show

[5837 rows x 4 columns]

In [78]:
netDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5837 entries, 0 to 5836
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       5837 non-null   object
 1   director    3936 non-null   object
 2   date_added  5195 non-null   datetime64[ns]
 3   type        5837 non-null   object
dtypes: datetime64[ns](1), object(3)
memory usage: 182.5+ KB

In [79]:
netDF["type"]=netDF["type"].astype("category")

In [80]:
netDF.info()  #1.번 해결 완료

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5837 entries, 0 to 5836
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       5837 non-null   object
 1   director    3936 non-null   object
 2   date_added  5195 non-null   datetime64[ns]
 3   type        5837 non-null   category
dtypes: category(1), datetime64[ns](1), object(2)
memory usage: 142.8+ KB

In [81]:
#2. 제목이 'Limitless'인 모든 콘텐츠 찾기

In [82]:
# 헷갈렸지만 찾기라면 불링 인덱싱으로 찾아보자

In [83]:
netmark=netDF["title"]=='Limitless'

In [84]:
netDF[netmark]

          title         director date_added     type
1559  Limitless      Neil Burger 2019-05-16    Movie
2564  Limitless              NaN 2016-07-01  TV Show
4579  Limitless  Vrinda Samartha 2019-10-01    Movie

3.Robert Rodriguez 감독이 제작하고 유형이 Movie인 모든 콘텐츠 찾기

In [85]:
directorROD=netDF["director"]=="Robert Rodriguez"
typemovie=netDF["type"]=="Movie"

In [86]:
netDF[directorROD & typemovie]

,title,director,date_added,type
1384,Spy Kids: All the Time in the World,Robert Rodriguez,2019-02-19,Movie
1416,Spy Kids 3: Game Over,Robert Rodriguez,2019-04-01,Movie
1460,Spy Kids 2: The Island of Lost Dreams,Robert Rodriguez,2019-03-08,Movie
2890,Sin City,Robert Rodriguez,2019-10-01,Movie
3836,Shorts,Robert Rodriguez,2019-07-01,Movie
3883,Spy Kids,Robert Rodriguez,2019-04-01,Movie

4. 등록된 날짜가 '2019-07-31' 이거나 'Robert Altman'인 콘텐츠 찾기

In [87]:
date2019=netDF["date_added"]=="2019-07-31"
directorro=netDF["director"]=="Robert Altman"

In [88]:
netDF[date2019 | directorro]

                                title       director date_added     type
611                            Popeye  Robert Altman 2019-11-24    Movie
1028        The Red Sea Diving Resort    Gideon Raff 2019-07-31    Movie
1092                     Gosford Park  Robert Altman 2019-11-01    Movie
3473  Bangkok Love Stories: Innocence            NaN 2019-07-31  TV Show
5117                       Ramen Shop      Eric Khoo 2019-07-31    Movie

5.

In [89]:
# directorOR=netDF["director"]=='Orson Welles'
# directorAD=netDF["director"]=='Aditya Kripalani'
# directorSA=netDF["director"]=='Sam Raimi'

In [90]:
# netDF[directorOR&directorAD&directorSA]

In [91]:
# 이렇게 생각했는데 아니었다...

In [92]:
#isin을 쓰는 구문이다.

(1) 포함하는 리스트 만들기

In [93]:
direclist=['Orson Welles','Aditya Kripalani','Sam Raimi']
direc3=netDF["director"].isin(direclist)

In [94]:
netDF[direc3]

                           title          director date_added   type
946                 The Stranger      Orson Welles 2018-07-19  Movie
1870                    The Gift         Sam Raimi 2019-11-20  Movie
3706                Spider-Man 3         Sam Raimi 2019-11-01  Movie
4243        Tikli and Laxmi Bomb  Aditya Kripalani 2018-08-01  Movie
4475  The Other Side of the Wind      Orson Welles 2018-11-02  Movie
5115    Tottaa Pataaka Item Maal  Aditya Kripalani 2019-06-25  Movie

6.between사용하기

In [96]:
bet=netDF["date_added"].between('2019-05-01','2019-06-01')

In [100]:
netDF[bet].sort_values('date_added') #정렬 완료

,title,director,date_added,type
5829,The Kindness Diaries,NaN,2019-05-01,TV Show
1153,American Experience: The Island Murder,Mark Zwonitzer,2019-05-01,Movie
1975,Sur Sapata,Mangesh Kanthale,2019-05-01,Movie
2003,Teenage Mutant Ninja Turtles,Kevin Munroe,2019-05-01,Movie
378,John & Yoko: Above Us Only Sky,Michael Epstein,2019-05-01,Movie
...,...,...,...,...
2733,Small Soldiers,Joe Dante,2019-06-01,Movie
4078,Love Is a Story,Cristina Jacob,2019-06-01,Movie
4890,Life in the Doghouse,Ron Davis,2019-06-01,Movie
3309,The Phantom of the Opera,Joel Schumacher,2019-06-01,Movie
170,Carrie,Brian De Palma,2019-06-01,Movie

7. dropna 사용

In [104]:
# netDF['director'].dropna(how='all')  이게 아니다. dropna를 쓸떄는 특정 열을 떼주고 싶을떄 subset을 사용해야 한다.

In [105]:
netDF.dropna(subset=['director'])

                                   title        director date_added   type
1                         A Patch of Fog  Michael Lennox 2017-04-15  Movie
3                              Uriyadi 2     Vijay Kumar 2019-08-02  Movie
4                      Shrek the Musical     Jason Moore 2013-12-29  Movie
5                       Schubert In Love     Lars Büchel 2018-03-01  Movie
6     We Have Always Lived in the Castle   Stacie Passon 2019-09-14  Movie
...                                  ...             ...        ...    ...
5830                         Bibi & Tina     Detlev Buck 2017-04-15  Movie
5832                         The Pursuit     John Papola 2019-08-07  Movie
5833                    Hurricane Bianca   Matt Kugelman 2017-01-01  Movie
5834                        Amar's Hands  Khaled Youssef 2019-04-26  Movie
5835               Bill Nye: Science Guy  Jason Sussberg 2018-04-25  Movie

[3936 rows x 4 columns]

8.  콘텐츠를 하나만 등록한 날짜

In [107]:
# 같은 날에 등록했다면 date_added값의 날짜가 동일할 것이다....

In [109]:
netDF.drop_duplicates(subset=["date_added"],keep=False)  # subset에 있는 열에 있는 값들 중에 중복항목이 있는 모든 정보

,title,director,date_added,type
4,Shrek the Musical,Jason Moore,2013-12-29,Movie
12,Without Gorky,Cosima Spender,2017-05-31,Movie
30,Anjelah Johnson: Not Fancy,Jay Karas,2015-10-02,Movie
38,One Last Thing,Tim Rouhana,2019-08-25,Movie
70,Marvel's Iron Man & Hulk: Heroes United,Leo Riley,2014-02-16,Movie
...,...,...,...,...
5748,Menorca,John Barnard,2017-08-27,Movie
5749,Green Room,Jeremy Saulnier,2018-11-12,Movie
5788,Chris Brown: Welcome to My Life,Andrew Sandler,2017-10-07,Movie
5789,A Very Murray Christmas,Sofia Coppola,2015-12-04,Movie
5812,Little Singham in London,Prakash Satam,2019-04-22,Movie